export default {
  id: 2,
  name: 'yanliuhen',
  content: `
百周地域单通初期经验分享
1、开局内属。推荐阳内，暗器标死龙门三侠（准备20-30个黑血神针），第一武功罗汉伏魔（既当内功又当外功，省格子。优点：1、高级内功，气防高2、罗汉伏魔内力消耗量加成攻击，罗汉作外功攻击消耗不低，3、保持攻击节奏，回血--残血进攻，血量在1/4时，有可能维持住持续攻击4，范围广）；阴内（自带武功较强或先天天赋较强的可以拿混元功），收温青青，金蛇洞打老太婆（带皮衣满级免疫冰封） 优点：混乱，集气紊乱(这两个特效可以制造奇迹，适合压制流)，高级阴内可触发寒冰界。
2、轻功（还施水阁换你准备学的轻功对于的基础轻功），阳内轻功首推幻尘身法（自动防御，减伤0.2，40%易容），比迷踪步稳定可预期，初中期都算第一轻工，后期玉泉第一轻功。阴内，灵鳌步或者瞬息千里，也可以提纵术先用，后期一脉蛇行狸翻

有了罗汉就可以刷丐帮，（每条）经脉前两三个10点的，都点上，轻功经脉点到鱼龙跃（一资到此轻功属性340左右+基础轻功50，剩下十点左右根据自己规划点经脉，凑400）学绝学轻功
初期两大关键点：
李莫愁（获得铁匠，武器买判官笔，30%封穴5-8点（提高封穴几率）；衣服：佛心甲免疫灼烧，打金花婆婆要用）皮衣，佛心甲，乌蝉衣都六级，按需使用
金花婆婆：穿佛心甲，打赢就可以练黑玉断续膏了，有药就有底气

豪侠：1、商家堡第二弱2、扬州妓院余沧海3，友爱的喵姐，看情况选择

神照可以不练，一条命打不赢，多条命也没啥大作用。1资开左右，两个武功混到没问题，其他资质再学一个高级（金刚不坏或者瑜伽，减伤），也可以到豪侠了
然后可以入门派了（如果规划明确了门派，可以提早入，更轻松）

地域百周，能让玩家把每个微小的游戏设定都运用上，有时候，多出两次封穴，就过了，免疫灼烧，血线就维持住了。低难度碾压局是感受不到的

李莫愁是一流中的消耗王，初始伤害不高，后期被毒高了，暗器三连加攻击，容易翻车。药还多！！但难度低于金花。

金花：收益巨大，难度也大。一流中的豪侠。幻尘身法减伤，倾国倾城反弹，我方移动步数小，对方攻击范围大。圣火免疫负面状态（中毒，灼烧冰封都用不上），攻击必灼烧（带6级佛心甲）
此战我方就罗汉伏魔功+一个初级轻工。过了金花，学上幻尘身法，有黑玉断续膏，可战豪侠。
打金花的收益：1，幻尘身法，有他减伤可以挑战豪侠2，胡青牛入队拿了医书，可以练黑玉3，毒经，学了秘技上毒，为后面累计微弱优势（中毒减集气速度，休息不回血），毒经加用毒，学完够100用毒点毒经脉第一个大穴，加攻击带毒
打金花的注意点：
1、金花减移动步数，被减完步数一般在2-3格，导致她逃跑我们追不上。对策：开局让金花进入门口栏杆里面，然后我们堵住栏杆通道，不让她四处逃串。这里有必要sl。
2、金花会随机出倾国倾城特效，反弹伤害。对策：首先要观察金花身上的状态，其次，保持好血量，什么时候吃药什么时候攻击，这个得自己体会。罗汉回血的作用此时就体现出来了。吃药多攻击少会陷入死循环。
3，怒气。观察对方怒气，对方怒气80左右，要保持高血量，以免被一波带走。自己怒气80，这轮不攻击，吃药，（增加能量）下次被打后才有血量敢于攻击。自己暴怒时，不要因为能量不够和血线过低导致不能攻击。暴怒是：高连击，绝招1.5倍伤害。
4、观察敌我集气位置。如果位置很靠近，下次攻击有可能金花会打你两轮。选择吃药，保持血线，以免被打爆。如果我方出手时，金花在集气条尾巴，此时可以放心进攻，哪怕血量低，罗汉会帮你回血。
5、药，这一站的药会消耗比较多。前面黑玉尽量不要用，需要较多。看血量吃药，能吃小药，不吃黑玉。保命丸有冷却，作用不大。
      `,
};