export default {
  id: 3,
  name: '⑨',
  content: `
  1.07v25－fix71 一周地狱 单通 1资阳指，少林门派开局
1资阳指，少林门派开局，地狱一周目单通战报

下面是游戏流程：
一、开局开荒阶段
开局回家对话迷之少女，选全搜刮，然后去江陵天宁寺选慈悲道德到65（非必要，只是开局习惯了），龙门客栈买皮衣装备，古墓招募小龙女得金丝手套装备，去冲霄洞对话赵钱孙和谭婆，选不去，拿海叟钓法练上以后回门派学少林心法，接着就可以找小和尚练功了，我们要刷到200的秘籍残章，然后去苏州燕子坞换神照功，学上神照用经验直接点到10级，去做笑傲江湖的天书剧情一直到华山后山打令狐冲，然后选择体验详实剧情，华山派大厅剧情杀成不忧直升一流，天赋选长风万里和过目不忘，长风万里前中期可以一直带着，它让我们得集气更快，而过目不忘则是让我们在游戏中后期就能拥有全满的三围，因为我们是门派弟子开局，初始就有100天赋点，所以拿到就能直接用。达到一流后，此时我们的门派贡献在孜孜不倦的刷小和尚时候也应该早就够200点以上了，这时可以把规划里需要的门派中级武功学上，学武功和练级时候记得一直带着过目不忘。然后去龙门客栈做侠客行的天书剧情，打三个小兵拿玄冰碧火酒，跟叮当交任务后去长乐帮贝海石旁边的桌子上拿罗汉伏魔功，因为我们是少林，罗汉伏魔功可以一脉相承，学满级以后就可以去丐帮刷大狗阵了，一边练功，一边可以拿经脉点点点经脉，一边刷秘技残页到300（如果打不过打狗阵就回去再刷刷小和尚先练练武功等级），去燕子坞换金锁银铃和提纵术，练满级后去破庙打陈达海得白马装备，至此初期开荒完毕，接下来就是上豪侠和宗师了。（注：刷小和尚可以得不少钱，除了开燕子坞需要6000块以外，剩下的全部回家买食材做腊八粥优先把内力吃满，后面有富裕的钱就去扬州买千年灵芝加体质，千年灵芝20000一个）

二、前中期流程
按照规划表里练的武功，我们现在已经初具战斗力了，接下来就是走射雕天书剧情到桃花岛比武招亲，然后走神雕天书剧情到蜘蛛洞救出老顽童，得左右互搏练上，此时可以走倚天天书剧情，朱府对话选择告诉张无忌、昆仑派对话拦门弟子、龙门客栈打灭绝（此战无所谓输赢）、收殷离，让殷离离队然后回家对话殷离送礼（殷离喜欢药品，我们开局搜刮了好多药，不缺的），好感度到200以后就求婚、然后对着家里的床一直点过一天直到生孩子，对话孩子选两个低级天赋，拿诸行无常和名相皆无。带上诸行无常，就可以用内功当外功来攻击了，此时我们可以用罗汉伏魔功当外功，检查一下自己的属性把能点的经脉点都点好。好了，现在穿上满级的皮衣，可以去云岭洞对话右上角冰蚕打游坦之上豪侠了，豪侠以后可以回门派对照规划表把各种高级武功学上（注意内功不要学金刚不坏，因为金刚不坏和罗汉伏魔功一起会触发一个秘技，这个秘技我们这个流程基本不需要，会占一个格子，当然要是学了也无所谓，我们可以把规划表里的施毒那个秘技替换掉）。高级武功练满（依旧刷丐帮）多罗叶指那一步要暂停，因为我们需要除却四相这个秘技，所以这个多罗叶指我们要一直保留到我们学会无相劫指出了除却四相这个秘技以后再选择一脉成门派高级指法。云岭洞对话喵姐打一架得迷踪步，练满。现在我们有两门高级内功了，指法也应该很高了，可以点新的经脉奇穴了，依次点手少阴经（能点的全点）、手阳明经（点第一个奇穴浴火）、足少阴经（能点全点）、足太阳经（点到第二个奇穴归元境），现在可以去嵩山打左冷禅上宗师了，打前存个档，有很小的概率会翻车。

三、破局成型
上宗师以后，回门派进行绝学挑战，很简单的一战，打完就可以学绝学了，优先学无相劫指，配合大智无定指+拈花指+多罗叶指学会秘技除却四相，然后就把能一脉的武功都一脉到绝学吧，此时我们主运易筋神功，外功就用无相劫指就好。药王庙挖坟打寇仲、对话徐子陵单挑，胜利后得长生诀，神照一脉长生诀。走侠客行天书剧情到侠客岛打龙木二岛主拿太玄神功（此时先不要挑战李白），练满太玄，改主运太玄神功。至此我们基本上就可以横扫天书剧情了，可以先去华山后山挑战谢无忧和谢流云，天赋内功我习惯选长生诀，可以用来点足太阳经的第三个奇穴离经易道，加体质。打完拿无极丹洗掉金锁银铃，空一个格子出来方便我们后面学武功。然后继续走倚天天书剧情到收张无忌入队，此时会解锁昆仑仙境，传送过去先打金轮法王一行人，再对话阿青，单挑阿青上神话（天赋记得选武中无相，当然九阴至尊也可以）。接下来去江陵比武，sl洗第一格武功为九阴白骨爪。然后就是按照规划流程拿九阴、蛇形狸翻（森罗万象）和北冥、吸星、乾坤（万象天引）。以及打天书凑够天赋点用来装备天赋了。（天书推荐打鹿鼎、飞雪、鸳鸯，可以拿到千年灵芝和中庸，虽然我们1资不能触发效果，但是可以用来点经脉任脉）。拿到足够天书后看看家里神秘少女周目商店有没有刷出来无极丹，有的话就在已经学会秘技的基础上洗掉一个除九阴和我们要主运的武功以外的武功，学个九阳凑阴阳合一这个秘技，如果没刷出无极丹，那就等天下会比武，那边大概率会给无极丹，如果都没有那就只能放弃学九阳拿阴阳合一了。（记得华山后山华山论剑，选阿凡提、东方不败、周伯通）

四、20大
最终我们凑够足够的天赋点，装备天赋白驹过隙、无形气墙、名相皆无、西狂怒啸、三才归元，能点到经脉奇穴都点出来，规划里的医书秘技都学上，人物装备方面我选择了金丝手套、软猬甲、青驴。可以去武道大会挑战20大了，这里我选择了众神之战，因为20众神的集气是压不下去的，所以我们其实主要是靠着三才归元和白驹的反击去打，主运太玄提高特效几率和续航能力，天赋名相皆无提供特效二次判定，我们这个人物最终是很硬的，打20大众神怕翻车的话也可以轮到自己行动时候吃个药，我这里中间吃了一颗天王，后面出了长生诀的复活，但还是一次过了。

以上，攻略完毕。
  `,
};
