export default {
  normal: [
    {
      map: '破庙（北部）',
      event: [
        {
          list: ['进入场景，正邪分支'],
          reward: {},
        },
      ],
    },
  ],
  good: [
    {
      map: '破庙（北部）',
      event: [
        {
          list: [
            '剧情后，选择『是』进入正线，触发战斗：',
            'VS 陈达海+铁掌帮众',
            '胜利后得 [黑血神针]*3',
            '李文秀入队，得[白马]、[手帕]',
          ],
          reward: {
            mor: 2,
            itm: {224: 1, 230: 1},
            team: {590: true},
          },
        },
      ],
    },
    {
      map: '沙漠废墟（北部）',
      event: [
        {
          list: ['进入场景后触发战斗：', 'VS 一群喽啰'],
          reward: {},
        },
        {
          list: [
            '战斗胜利后，点击废墟内的柜子，开启密道进入高昌迷宫',
            '身上有[玄铁剑]、[屠龙刀]、[倚天剑]三把兵器之一即可劈开石门',
            '迷宫内开宝箱获得：',
            '《白马啸西风》、[天山雪莲]、银两*1000、【玄虚刀法】',
          ],
          reward: {
            itm: {149: 1, 138: 1, 17: 1, 174: 1000},
          },
        },
      ],
    },
  ],
  evil: [
    {
      map: '破庙（北部）',
      event: [
        {
          list: ['剧情后，选择『否』进入邪线，触发战斗：', 'VS 陈达海'],
          reward: {
            mor: -3,
            itm: {224: 1, 230: 1, 173: 1},
          },
        },
      ],
    },
    {
      map: '沙漠废墟（北部）',
      event: [
        {
          list: ['进入场景后触发战斗：', 'VS 木灵子+一群喽啰'],
          reward: {},
        },
        {
          list: [
            '战斗胜利后，点击废墟内的柜子，开启密道进入高昌迷宫',
            '身上有[玄铁剑]、[屠龙刀]、[倚天剑]三把兵器之一即可劈开石门',
            '迷宫内开宝箱获得：',
            '《白马啸西风》、[天山雪莲]、银两*1000、【玄虚刀法】',
          ],
          reward: {
            itm: {149: 1, 138: 1, 17: 1, 174: 1000},
          },
        },
      ],
    },
  ],
};
