export default {
  normal: [
    {
      map: '大理（西部）',
      event: [
        {
          list: ['与客栈里温青青对话，可收其入队'],
          reward: {
            mor: 1,
            itm: {133: 1},
            team: {91: true},
          },
        },
      ],
    },
    {
      map: '华山下-金蛇山洞（中原）',
      event: [
        {
          list: ['温青青在队，调查金蛇剑旁边的白骨，剧情后再拔起金蛇剑', '获得[金蛇剑]、【金蛇剑法】'],
          reward: {
            itm: {40: 1, 121: 1},
            other: ['温青青第一格洗金蛇剑法6级'],
          },
        },
        {
          list: ['离开时，遇到何红药，触发战斗：', 'VS 何红药'],
          reward: {},
        },
      ],
    },
    {
      map: '金陵（江南）',
      event: [
        {
          list: ['进入场景触发剧情，剧情后与左边房间袁承志对话，剧情后', '[金蛇剑]交给袁承志，温青青离队'],
          reward: {
            itm: {40: -1},
            team: {91: false},
          },
        },
        {
          list: ['大厅对话阿九，正邪分支'],
          reward: {},
        },
      ],
    },
  ],
  good: [
    {
      map: '金陵（江南）',
      event: [
        {
          list: ['与阿九对话，选择『是』，进入正线'],
          reward: {mor: 2},
        },
        {
          list: ['调查右上没人的房间柜子，获得[太白三英的书信]'],
          reward: {
            itm: {232: 1},
          },
        },
        {
          list: ['将[太白三英的书信]交给阿九'],
          reward: {mor: 1},
        },
      ],
    },
    {
      map: '金龙帮（江南）',
      event: [
        {
          list: ['剧情后触发战斗：', '1、主角 VS 闵子华+洞玄', '2、主角 VS 梅剑和', '3、VS 梅剑和+闵子华+洞玄+太白三英+刘培生'],
          reward: {mor: 3},
        },
        {
          list: ['战斗后，与焦宛儿对话可得[金龙鞭]'],
          reward: {
            itm: {51: 1},
          },
        },
      ],
    },
    {
      map: '金陵（江南）',
      event: [
        {
          list: ['大功坊左下厨房调查柴堆开启密道，进入大功坊地窖', '剧情后开启宝箱获得[银两]*4000 【混元功法】'],
          reward: {
            itm: {68: 1, 174: 4000},
          },
        },
      ],
    },
    {
      map: '五仙教（西部）',
      event: [
        {
          list: ['剧情后触发战斗：', 'VS 何铁手+五毒教徒*10'],
          reward: {mor: 1},
        },
      ],
    },
    {
      map: '华山下-华山后山（中原）',
      event: [
        {
          list: ['剧情后触发战斗：', '主角 VS 玉真子', '剧情后温青青重伤'],
          reward: {mor: 3},
        },
        {
          list: [
            '若队伍中有医生（薛慕华、平一指、胡青牛、贝海石）',
            '会医好温青青，剧情后获得《碧血剑》【混元掌】',
            '回小村可收袁承志、温青青入队，获得[金蛇剑]、[金蛇锥]*10',
            '*袁承志解锁天赋：长平公主的眷恋',
          ],
          reward: {
            branch: {id: 1, name: '救温青青'},
            mor: 3,
            itm: {156: 1, 463: 1, 40: 1, 30: 10},
            team: {54: true, 91: true},
          },
        },
        {
          list: [
            '若队伍中没有医生（薛慕华、平一指、胡青牛、贝海石）',
            '温青青死去，袁承志离开，朱媺娖入队', '获得【玄女剑法】',
          ],
          reward: {
            branch: {id: 1, name: '不救温青青'},
            mor: 3,
            itm: {504: 1},
            team: {629: true},
          },
        },
      ],
    },
    {
      map: '勃泥岛（海外） 不救温青青开启',
      event: [
        {
          list: ['与袁承志对话可收袁承志入队', '获得《碧血剑》、[金蛇剑]、[金蛇锥]*10'],
          reward: {
            branch: {id: 1, name: '不救温青青'},
            itm: {156: 1, 40: 1, 30: 10},
            team: {54: true},
          },
        },
      ],
    },
  ],
  evil: [
    {
      map: '金陵（江南）',
      event: [
        {
          list: ['与阿九对话，选择『否』，进入邪线'],
          reward: {mor: -2},
        },
      ],
    },
    {
      map: '金龙帮（江南）',
      event: [
        {
          list: ['进入场景发现金龙帮被灭'],
          reward: {},
        },
        {
          list: ['出去之后，再次进入金龙帮，与焦宛儿对话', '焦宛儿入队，获得[金龙鞭]'],
          reward: {
            mor: -1,
            itm: {51: 1},
            team: {607: true},
          },
        },
      ],
    },
    {
      map: '金陵（江南）',
      event: [
        {
          list: ['大功坊左下厨房调查柴堆开启密道，进入大功坊地窖', '开启宝箱获得【混元功法】[银两]*4000'],
          reward: {
            itm: {68: 1, 174: 4000},
          },
        },
      ],
    },
    {
      map: '五仙教（江南）',
      event: [
        {
          list: ['剧情后触发战斗：', '1、VS 五毒教徒*10', '2、主角 VS 何铁手', '胜后，获得【混元功法】', '可收何铁手入队'],
          reward: {
            itm: {68: 1},
            team: {83: true},
          },
        },
      ],
    },
    {
      map: '华山下-华山后山（中原）',
      event: [
        {
          list: ['剧情后触发战斗：', 'VS 袁承志+温青青+穆人清等人', '战斗后得《碧血剑》【铁布衫】【铁剑诀】 [金蛇剑] 金蛇锥*10'],
          reward: {
            mor: -5,
            itm: {156: 1, 526: 1, 507: 1, 40: 1, 30: 10},
          },
        },
      ],
    },
  ],
};
