export default {
  normal: [
    {
      map: '唐诗山洞（江南）',
      event: [
        {
          list: ['与狄云对话，选是狄云入队，得[乌蚕衣]', '开启狄云身后的箱子的[唐诗选集]'],
          reward: {
            mor: 2,
            itm: {206: 1, 59: 1},
            team: {37: true},
          },
        },
      ],
    },
    {
      map: '破庙（北部）',
      event: [
        {
          list: ['狄云在队时，点击丁典的坟触发剧情后进入破庙里，触发战斗：', '主角+狄云 VS 宝象', '胜后得【血刀心法】'],
          reward: {
            itm: {361: 1},
          },
        },
      ],
    },
    {
      map: '龙门客栈（西部）',
      event: [
        {
          list: ['进入客栈后触发剧情，狄云被血刀老祖掳走'],
          reward: {
            team: {37: false},
          },
        },
      ],
    },
  ],
  good: [
    {
      map: '雪山（北部）',
      event: [
        {
          list: ['剧情后，选择『否』进入正线，触发战斗：', 'VS 血刀老祖', '胜后得【鬼头刀法】'],
          reward: {
            mor: 2,
            itm: {164: 1},
          },
        },
        {
          list: ['剧情后狄云神照功大成属性提升', '与狄云对话后收狄云入队，得【血刀经】'],
          reward: {
            itm: {139: 1},
            team: {37: true},
            other: [
              '狄云奖励：攻击+30、防御+30、轻功+30，五系兵器值+10，第二格武功洗血刀大法 1级',
            ],
          },
        },
        {
          list: ['对着水盆使用[唐诗选集]，得知连城诀的秘密', '狄云学会连城剑法，获得【连城剑法】'],
          reward: {
            itm: {237: 1},
            other: [
              '狄云奖励：第三格武功洗连城剑法 1级',
            ],
          },
        },
      ],
    },
    {
      map: '江陵-天宁寺（江南）',
      event: [
        {
          list: ['进入场景后触发战斗：', 'VS 一群喽啰'],
          reward: {},
        },
        {
          list: [
            '点击天宁寺内佛像背后获得《连城诀》',
            '若道德≥80且狄云在队额外获得【神照经】，并且出门触发剧情，狄云被戚长发偷袭，进入战斗：',
            'VS 戚长发',
          ],
          reward: {
            mor: 1,
            itm: {146: 1, 71: 1},
          },
        },
      ],
    },
    {
      map: '雪山（北部） 需在天宁寺拿到神照经',
      event: [
        {
          list: ['狄云在队时，与水笙对话，可收水笙入队'],
          reward: {
            team: {589: true},
          },
        },
      ],
    },
  ],
  evil: [
    {
      map: '雪山（北部）',
      event: [
        {
          list: ['剧情后，选择『是』进入邪线，触发战斗：', '1、VS 落花流水+水笙', '2、主角 VS 水笙（暴走版）'],
          reward: {mor: -2},
        },
        {
          list: [
            '战斗后花铁干向主角求饶命，若选择不杀花铁干',
            '可收花铁干入队，获得【中平枪法】',
            '*若之前有偷取中平枪法秘籍，则无法重复获得',
          ],
          reward: {
            mor: -1,
            itm: {184: 1},
            team: {52: true},
          },
        },
        {
          list: [
            '血刀老祖给予【血刀经】，再次与其对话，选『是』触发战斗：',
            'VS 血刀老祖',
            '胜后获得[血刀]、【血河神鉴】',
          ],
          reward: {
            itm: {139: 1, 285: 1, 44: 1},
          },
        },
        {
          list: ['对着水盆使用[唐诗选集]，得知连城诀的秘密', '同时获得【连城剑诀】'],
          reward: {
            itm: {237: 1},
          },
        },
      ],
    },
    {
      map: '江陵-天宁寺（江南）',
      event: [
        {
          list: ['进入场景后触发战斗：', 'VS 一群喽啰'],
          reward: {},
        },
        {
          list: ['点击天宁寺内佛像背后获得《连城诀》'],
          reward: {
            itm: {146: 1},
          },
        },
      ],
    },
  ],
};
