export default {
  normal: [
    {
      map: '扬州-天上人间（江南）',
      event: [
        {
          list: ['与右上房间的韦小宝对话，韦小宝入队', '获得【一指禅】'],
          reward: {
            itm: {274: 1},
            team: {601: true},
          },
        },
      ],
    },
    {
      map: '沧州-有间客栈（北部）',
      event: [
        {
          list: ['韦小宝在队，触发剧情后进入战斗：', '主角 VS 海大富 （可败）', '胜利后获得【化骨绵掌】'],
          reward: {
            itm: {275: 1},
            team: {601: false},
          },
        },
      ],
    },
    {
      map: '北京（北部）',
      event: [
        {
          list: ['左边房间进门触发剧情，进入战斗：', 'VS 大内高手*4'],
          reward: {},
        },
        {
          list: ['客栈对话钱老板，花500两购得[茯苓花雕猪]'],
          reward: {
            itm: {272: 1},
          },
        },
        {
          list: [
            '对禁卫使用[茯苓花雕猪]，进入皇宫',
            '右上房间，进门触发剧情，进入战斗：',
            '主角+韦小宝 VS 鳌拜（可败）',
            '剧情后获得[皇宫通行令]',
            '*对战鳌拜如果失败将无法进入秘道抄家，但不影响拿天书',
          ],
          reward: {
            itm: {273: 1},
            team: {601: true},
          },
        },
        {
          list: [
            '出皇宫后，进入左上鳌拜府，对话椅子背后的柜子，发现秘道',
            '开启宝箱获得：',
            '[银两]*5000 [火枪] [金丝背心]【金刚不坏体】【火枪要术】【神行百变】',
          ],
          reward: {
            itm: {
              174: 5000,
              60: 1,
              276: 1,
              305: 1,
              265: 1,
              267: 1,
            },
            other: [
              '韦小宝奖励：',
              '第一格武功洗火枪极，第二格武功洗神行百变1级',
              '天赋外功洗为火枪，天赋轻功洗为神行百变',
            ],
          },
        },
      ],
    },
    {
      map: '台湾（海外）',
      event: [
        {
          list: [
            '韦小宝在队，进门触发剧情，进入战斗：',
            'VS 冯锡范+阿珂+郑克爽',
            '剧情后得[半部四十二章经]【凝血神爪】',
          ],
          reward: {
            itm: {228: 1, 261: 1},
          },
        },
      ],
    },
    {
      map: '神龙教（海外）',
      event: [
        {
          list: ['与看门小兵对话触发战斗：', 'VS 神龙教徒*8'],
          reward: {},
        },
        {
          list: ['进入屋内触发战斗：', 'VS 洪教主+苏荃+神龙教众', '胜后，韦小宝离队，获得[四十二章经]'],
          reward: {
            itm: {229: 1},
            team: {601: false},
          },
        },
      ],
    },
    {
      map: '小村（江南）',
      event: [
        {
          list: ['到北丑房间里的蜡烛处使用[四十二章经]，鹿鼎山开启'],
          reward: {},
        },
      ],
    },
    {
      map: '鹿鼎山（北部）',
      event: [
        {
          list: ['VS一大群大雪怪', '开启宝箱获得：', '银两*1000、千年灵芝、【百胜刀法】《鹿鼎记》'],
          reward: {
            itm: {
              174: 1000,
              14: 1,
              246: 1,
              150: 1,
            },
          },
        },
      ],
    },
    {
      map: '扬州-天上人间（江南）',
      event: [
        {
          list: [
            '与韦小宝对话，可收韦小宝、阿珂、苏荃入队',
            //'*可以在韦小宝处购买[霹雳弹]和[千年灵芝]*2'
          ],
          reward: {
            team: {601: true, 86: true, 87: true},
          },
        },
      ],
    },
  ],
};
