export default {
  normal: [
    {
      map: '蒙古包（北部）',
      event: [
        {
          list: ['与郭靖对话，可收郭靖入队'],
          reward: {
            team: {55: true},
          },
        },
      ],
    },
    {
      map: '北京（北部）',
      event: [
        {
          list: ['郭靖在队时，与客栈门口的黄蓉对话，触发剧情，正邪分支'],
          reward: {},
        },
      ],
    },
  ],
  good: [
    {
      map: '北京（北部）',
      event: [
        {
          list: [
            '郭靖在队时，与客栈门口的黄蓉对话，触发剧情，选『是』',
            '进入正线，触发战斗：',
            'VS 欧阳克',
            '胜后，郭靖离队，获得【奇门五转】【兰花拂穴手】',
          ],
          reward: {
            mor: 2,
            itm: {474: 1, 255: 1},
          },
        },
      ],
    },
    {
      map: '洪七公居（中原）',
      event: [
        {
          list: ['进入场景触发剧情'],
          reward: {},
        },
      ],
    },
    {
      map: '桃花岛（海外）',
      event: [
        {
          list: [
            '进入场景触发剧情，欧阳克、郭靖与主角比试：',
            '1、主角 VS 欧阳克（可败）',
            '2、主角 VS 郭靖（可败）',
            '剧情后，众人离开，获得【落英神剑掌】【旋风扫叶腿】【灵鳌步】',
            '*剧情后记得去看下左上房间墙壁上的对联',
          ],
          reward: {
            itm: {14: 1, 101: 1, 257: 1, 307: 1},
            other: [
              '千年灵芝需战胜郭靖',
              '神雕侠侣绝情谷剧情开启',
            ],
          },
        },
      ],
    },
    {
      map: '蒙古包（北部）支线',
      event: [
        {
          list: ['与柯镇恶对话触发剧情', 'VS 梅超风', '胜后获得【疯魔棍谱】【妙手空空】'],
          reward: {
            itm: {382: 1, 521: 1},
          },
        },
      ],
    },
    {
      map: '明霞岛（海外）',
      event: [
        {
          list: ['进入场景，剧情后触发战斗：', 'VS 欧阳锋'],
          reward: {mor: 1},
        },
      ],
    },
    {
      map: '嘉兴-牛家村（江南）',
      event: [
        {
          list: [
            '剧情后触发战斗：',
            '1、VS 欧阳克',
            '2、主角 VS 欧阳锋（可败）胜利后获得【蛤蟆功】',
            '3、主角+周伯通 VS 欧阳锋（可败）胜利后获得天山雪莲*2',
            '4、主角+周伯通+黄药师 VS 欧阳锋',
            '战斗结束剧情后获得【弹指神通】',
          ],
          reward: {
            mor: 4,
            itm: {214: 1, 73: 1, 95: 1, 17: 2},
            other: [
              '程英奖励：',
              '第二格武功洗弹指神通1级，第三格武功洗落英神剑掌1级',
            ],
          },
        },
      ],
    },
    {
      map: '铁掌峰（江南）',
      event: [
        {
          list: ['剧情后触发战斗：', 'VS 裘千仞+铁掌帮众*10'],
          reward: {mor: 1},
        },
      ],
    },
    {
      map: '一灯居（江南）',
      event: [
        {
          list: ['渔：给他[金娃娃](开局搜刮)可通过，道德+1', '否则可以选择与其交手杀过去，道德-1'],
          reward: {mor: 1},
        },
        {
          list: [
            '耕：西部农村选择教过小孩武功后并且不收银子可通过，道德+1',
            '否则可以选择与其交手杀过去，道德-1',
          ],
          reward: {mor: 1},
        },
        {
          list: ['樵，道德≥75，攻击≥100直接通过，道德+1', '否则可以选择与其交手杀过去，道德-1'],
          reward: {mor: 1},
        },
        {
          list: [
            '读，桃花岛看过对联，可以通过，道德+1',
            '奖励主角：拳指剑刀特五系兵器值可选其中一项+10',
            '否则可以选择与其交手杀过去，道德-1',
          ],
          reward: {
            mor: 1,
            other: ['五系兵器值可选其中一项+10'],
          },
        },
        {
          list: [
            '进入房间，剧情后触发战斗：',
            'VS 欧阳锋+裘千仞',
            '胜后，一灯送主角【先天功秘籍】【一阳指法】',
          ],
          reward: {
            mor: 8,
            itm: {77: 1, 96: 1},
          },
        },
      ],
    },
    {
      map: '一灯居（江南）',
      event: [
        {
          list: ['与读对话猜谜，若程英在队伍，再次与其对话即可解谜', '获得【妙笔丹青】'],
          reward: {
            mor: 8,
            itm: {172: 1},
          },
        },
      ],
    },
    {
      map: '桃花岛（海外）',
      event: [
        {
          list: ['道德≥80，与郭靖、黄蓉对话，回小村后可收郭靖、黄蓉入队', '*可选择郭靖内力属性'],
          reward: {
            mor: 1,
            itm: {262: 1, 58: 1},
            team: {55: true, 56: true},
            other: ['郭靖有一次选择内力属性的机会'],
          },
        },
      ],
    },
    {
      map: '洪七公居（中原）',
      event: [
        {
          list: ['与洪七公对话，得知天书在重阳宫'],
          reward: {},
        },
      ],
    },
    {
      map: '重阳宫（中原）',
      event: [
        {
          list: [
            '与丘处机对话，触发剧情，欧阳锋出现：',
            'VS 欧阳锋+裘千仞+蛇群',
            '获得【瞬息千里】',
            '战斗胜利后，王重阳出现吓跑欧阳锋',
          ],
          reward: {
            mor: 8,
            itm: {297: 1},
          },
        },
        {
          list: [
            '与王重阳对话，选『是』：',
            '主角 VS 王重阳（可败，可重复挑战）',
            '胜后获得《射雕英雄传》',
          ],
          reward: {
            itm: {148: 1},
          },
        },
        {
          list: [
            '道德≥90时与丘处机对话，王重阳送【先天功秘籍】',
            '道德≥99时与丘处机对话，王重阳送[九阴真经上卷]【蛇行狸翻】',
          ],
          reward: {
            itm: {77: 1, 286: 1, 369: 1},
          },
        },
      ],
    },
    {
      map: '华山下-华山后山（中原）',
      event: [
        {
          list: [
            '拿到《射雕英雄传》后，华山后山旁的阶梯上去，一直往右，走过石碑，进入华山绝顶，触发剧情进入战斗：',
            '主角 VS 洪七公+欧阳锋',
            '战后出现分支：',
          ],
          reward: {mor: 2},
        },
        {
          list: [
            '选择帮北丐则 主角 VS 欧阳锋，胜利后得[打狗棒]【打狗棒法】',
          ],
          reward: {
            branch: {id: 3, name: '帮北丐'},
            itm: {49: 1, 167: 1},
          },
        },
        {
          list: [
            '选择帮西毒则 主角 VS 洪七公，胜利后得[西毒蛇杖]【灵蛇杖法】',
          ],
          reward: {
            branch: {id: 3, name: '帮西毒'},
            itm: {244: 1, 247: 1},
          },
        },
      ],
    },
  ],
  evil: [
    {
      map: '北京（北部）',
      event: [
        {
          list: ['郭靖在队时，与客栈门口的黄蓉对话，触发剧情，选『否』获得【透骨打穴】，进入邪线'],
          reward: {
            mor: -2,
            itm: {256: 1},
            team: {55: false},
          },
        },
      ],
    },
    {
      map: '洪七公居（中原）',
      event: [
        {
          list: [
            '进入场景触发战斗：',
            '主角+欧阳克 VS 洪七公（可败，战胜可任选五系兵器值其一+10点）',
            '剧情后获得【瞬息千里】',
          ],
          reward: {
            itm: {297: 1},
            other: ['战胜洪七公五系兵器值可任选其一+10点'],
          },
        },
      ],
    },
    {
      map: '桃花岛（海外）',
      event: [
        {
          list: [
            '进入场景触发剧情，欧阳克、郭靖与主角比试：',
            '1、主角 VS 欧阳克（可败）',
            '2、主角 VS 郭靖（可败）',
            '剧情后，众人离开，获得【落英神剑掌】【旋风扫叶腿】',
            '*剧情后记得去看下左上房间墙壁上的对联',
          ],
          reward: {
            itm: {14: 1, 101: 1, 257: 1},
            other: [
              '千年灵芝需战胜郭靖',
              '神雕侠侣绝情谷剧情开启',
            ],
          },
        },
      ],
    },
    {
      map: '明霞岛（海外）',
      event: [
        {
          list: ['对话欧阳锋，剧情后，获得【白驼雪山掌】'],
          reward: {
            mor: -1,
            itm: {104: 1},
          },
        },
      ],
    },
    {
      map: '嘉兴-牛家村（江南）',
      event: [
        {
          list: ['剧情后触发战斗：', 'VS 欧阳克', '剧情后获得【蛤蟆功】'],
          reward: {
            mor: -3,
            itm: {73: 1, 214: 1},
          },
        },
      ],
    },
    {
      map: '云岭洞（中原）',
      event: [
        {
          list: ['与梅超风对话，选『是』收其入队', '*此支线在剧情进行到牛家村开启，一灯居后关闭'],
          reward: {
            team: {78: true},
          },
        },
      ],
    },
    {
      map: '蒙古包（北部）',
      event: [
        {
          list: ['与柯镇恶对话，出现分支'],
          reward: {},
        },
        {
          list: ['选择帮梅超风', 'VS 江南七怪', '胜后获得 [汗血宝马]【九阴白骨爪】'],
          reward: {
            branch: {id: 1, name: '帮梅超风'},
            mor: -5,
            itm: {262: 1, 102: 1},
          },
        },
        {
          list: ['选择帮江南七怪', 'VS 梅超风', '胜后获得【疯魔棍谱】【妙手空空】'],
          reward: {
            branch: {id: 1, name: '帮江南七怪'},
            mor: 2,
            itm: {382: 1, 521: 1},
            team: {78: false},
          },
        },
      ],
    },
    {
      map: '铁掌峰（江南）',
      event: [
        {
          list: ['VS 看门喽啰', '进屋与裘千仞对话，获得【铁掌掌谱】'],
          reward: ['铁掌掌谱[拳掌秘籍]'],
        },
      ],
    },
    {
      map: '一灯居（江南）',
      event: [
        {
          list: ['渔：给他[金娃娃](开局搜刮)可通过，道德+1', '否则可以选择与其交手杀过去，道德-1'],
          reward: {mor: 1},
        },
        {
          list: [
            '耕：西部农村选择教过小孩武功后并且不收银子可通过，道德+1',
            '否则可以选择与其交手杀过去，道德-1',
          ],
          reward: {mor: 1},
        },
        {
          list: ['樵，道德≥75，攻击≥100直接通过，道德+1', '否则可以选择与其交手杀过去，道德-1'],
          reward: {mor: 1},
        },
        {
          list: [
            '读，桃花岛看过对联，可以通过，道德+1',
            '奖励主角：拳指剑刀特五系兵器值可选其中一项+10',
            '否则可以选择与其交手杀过去，道德-1',
          ],
          reward: {
            mor: 1,
            other: ['五系兵器值任选其一+10点'],
          },
        },
        {
          list: [
            '进入房间，剧情后触发战斗：',
            'VS 一灯+渔樵耕读',
            '胜后，获得[软猬甲]【一阳指法】',
          ],
          reward: {
            mor: -10,
            itm: {96: 1, 58: 1},
          },
        },
      ],
    },
    {
      map: '重阳宫（中原）',
      event: [
        {
          list: [
            '与丘处机洪七公等人对话，触发战斗：',
            '1、VS 全真七子+全真教徒',
            '2、VS 周伯通+全真七子+全真教徒',
            '3、VS 周伯通+东邪+北丐+全真七子+全真教徒',
            '第4战前出现是否化干戈为玉帛选项',
          ],
          reward: {mor: -3},
        },
        {
          list: ['化干戈为玉帛：', '4、VS 王重阳+林朝英', '胜后获得《射雕英雄传》[九阴真经上卷]'],
          reward: {
            branch: {id: 2, name: '化干戈为玉帛'},
            mor: 3,
            itm: {148: 1, 286: 1},
          },
        },
        {
          list: [
            '不化干戈为玉帛：',
            '4、VS 王重阳+林朝英+周伯通+东邪+北丐+全真七子+全真教徒',
            '胜后获得《射雕英雄传》[九阴真经上卷][蛇行狸翻]',
          ],
          reward: {
            branch: {id: 2, name: '不化干戈为玉帛'},
            itm: {148: 1, 286: 1, 369: 1},
          },
        },
      ],
    },
    {
      map: '嘉兴-牛家村（江南）',
      event: [
        {
          list: ['一灯居战斗过后，与欧阳锋对话，选『是』获得【逆运真经】'],
          reward: {
            mor: -1,
            itm: {82: 1},
          },
        },
      ],
    },
    {
      map: '华山下-华山后山（中原）',
      event: [
        {
          list: [
            '拿到《射雕英雄传》后，华山后山旁的阶梯上去，一直往右，走过石碑，进入华山绝顶，触发剧情进入战斗：',
            '主角 VS 洪七公+欧阳锋',
            '战后出现分支：',
          ],
          reward: {mor: 2},
        },
        {
          list: [
            '选择帮北丐则 主角 VS 欧阳锋，胜利后得[打狗棒]【打狗棒法】',
          ],
          reward: {
            branch: {id: 3, name: '帮北丐'},
            itm: {49: 1, 167: 1},
          },
        },
        {
          list: [
            '选择帮西毒则 主角 VS 洪七公，胜利后得[西毒蛇杖]【灵蛇杖法】',
          ],
          reward: {
            branch: {id: 3, name: '帮西毒'},
            itm: {244: 1, 247: 1},
          },
        },
      ],
    },
  ],
};
