export default {
  normal: [
    {
      map: '古墓（中原）',
      event: [
        {
          list: ['与小龙女对话，选『是』小龙女加入', '*畅想杨过剧情略有不同，直接跳转下边的畅想杨过线'],
          reward: {
            itm: {358: 1},
            team: {59: true},
          },
        },
      ],
    },
    {
      map: '程英居（江南）',
      event: [
        {
          list: ['小龙女在队，进入场景触发战斗：', 'VS 李莫愁', '胜利后获得 【银索金铃】【狂风迅雷扇】'],
          reward: {
            itm: {175: 1, 498: 1},
          },
        },
        {
          list: ['与程英对话，小龙女离开队伍，程英入队，获得【玉箫剑法】'],
          reward: {
            itm: {123: 1},
            team: {59: false, 63: true},
          },
        },
        {
          list: ['与冯铁匠对话，可收其去小村', '在小村可以向冯铁匠购买一些装备或强化装备'],
          reward: {},
        },
      ],
    },
    {
      map: '绝情谷（中原）射雕桃花岛剧情后开启',
      event: [
        {
          list: [
            '进入大厅触发剧情，剧情后，主角被关起来',
            '调查房间里的兵器架，获得[君子剑][淑女剑]',
            '调查房间大门，触发剧情',
          ],
          reward: {
            itm: {241: 1, 242: 1},
          },
        },
        {
          list: ['剧情后进入大厅，触发战斗：', 'VS公孙止+绝情谷众', '胜后获得【阴阳倒乱刃】'],
          reward: {
            itm: {176: 1},
          },
        },
      ],
    },
    {
      map: '蜘蛛洞（北部）',
      event: [
        {
          list: [
            '打几场蜘蛛，进入最里面触发剧情， 剧情后获得：',
            '【玉女剑法】【玉女心经】【空明拳谱】【左右互搏术】',
            '蜘蛛洞宝箱可用6000两银两打开，可提升主角五系1点和三围1点',
          ],
          reward: {
            mor: 2,
            itm: {119: 1, 280: 1, 98: 1, 235: 1},
          },
        },
      ],
    },
    {
      map: '独孤剑冢（北部）',
      event: [
        {
          list: [
            '进入山洞，触发战斗：',
            'VS 大蛇',
            '拔起神雕旁边的剑获得【玄铁剑】',
            '阅读神雕旁边的墙壁获得【玄铁剑法】',
          ],
          reward: {
            mor: 2,
            itm: {36: 1, 116: 1},
          },
        },
      ],
    },
    {
      map: '重阳宫（中原）',
      event: [
        {
          list: ['剧情后触发正邪分支'],
          reward: {},
        },
      ],
    },
  ],
  good: [
    {
      map: '重阳宫（中原）',
      event: [
        {
          list: ['剧情后选择『否』，触发战斗：', 'VS 金轮法王+霍都+达尔巴+西域三魔'],
          reward: {mor: 5},
        },
      ],
    },
    {
      map: '古墓（中原）',
      event: [
        {
          list: ['对话杨龙夫妇'],
          reward: {},
        },
      ],
    },
    {
      map: '绝情谷（中原）',
      event: [
        {
          list: [
            '程英在队时，进入大厅剧情后触发战斗：',
            '1、主角+程英 VS 裘千尺+绝情谷众',
            '2、主角+程英 VS 公孙止',
            '剧情后小龙女定下十六年之约，杨过离去',
          ],
          reward: {mor: 5},
        },
        {
          list: ['调查后面花园里的断肠草，获得[断肠草]'],
          reward: {
            itm: {201: 1},
          },
        },
      ],
    },
    {
      map: '独孤剑冢（北部）',
      event: [
        {
          list: ['对杨过使用[断肠草]，剧情后获得[瘦黄马]'],
          reward: {
            mor: 2,
            itm: {284: 1},
          },
        },
      ],
    },
    {
      map: '江陵（江南）',
      event: [
        {
          list: [
            '进入客栈触发剧情，剧情后郭襄随队行动',
          ],
          reward: {},
        },
      ],
    },
    {
      map: '万兽山庄（江南）',
      event: [
        {
          list: ['调查后院的宝箱获取天外陨铁，用于修复倚天邪断剑断刀'],
          reward: {
            itm: {263: 2},
          },
        },
      ],
    },
    {
      map: '黑龙潭（江南）',
      event: [
        {
          list: ['与杨过对话，杨过入队', '进屋与瑛姑对话，答应帮其找周伯通'],
          reward: {
            team: {58: true},
          },
        },
      ],
    },
    {
      map: '百花谷（中原）',
      event: [
        {
          list: ['与周伯通对话，触发战斗：', '主角+杨过 VS 周伯通', '胜后杨过送【黯然销魂掌】【大伏魔拳】'],
          reward: {
            mor: 3,
            itm: {87: 1, 499: 1},
            team: {58: false},
          },
        },
      ],
    },
    {
      map: '黑龙潭（江南）支线',
      event: [
        {
          list: ['对话周伯通，触发剧情'],
          reward: {},
        },
      ],
    },
    {
      map: '百花谷（中原）支线',
      event: [
        {
          list: ['对话周伯通，如之前学有左右互搏则触发概率永久增加20%', '对话瑛姑，主角轻功+20'],
          reward: {
            other: [
              '左右互搏则触发概率永久增加20%',
              '主角轻功+20',
            ],
          },
        },
      ],
    },
    {
      map: '绝情谷（中原）',
      event: [
        {
          list: ['杨过在队，右上断崖触发剧情，前往绝情谷底'],
          reward: {},
        },
        {
          list: ['来到谷底触发剧情，杨过、小龙女入队'],
          reward: {
            itm: {280: 1, 282: 1},
            team: {58: true, 59: true},
          },
        },
        {
          list: ['从断崖上来，触发剧情'],
          reward: {},
        },
      ],
    },
    {
      map: '襄阳（中原）',
      event: [
        {
          list: [
            '进入襄阳城外，触发剧情进入战斗：',
            '主角+杨过+小龙女+神雕 VS 金轮法王',
            '胜后获得《神雕侠侣》【龙象般若功】【玉女素心剑】 青驴[坐骑]',
          ],
          reward: {
            mor: 5,
            itm: {153: 1, 350: 1, 81: 1, 339: 1},
          },
        },
      ],
    },
  ],
  evil: [
    {
      map: '重阳宫（中原）',
      event: [
        {
          list: [
            '剧情后选择『是』，触发战斗：',
            'VS 全真七子+全真教徒',
            '战斗结束后，获得【无上大力杵】【龙象般若功】',
          ],
          reward: {
            mor: -10,
            itm: {170: 1, 81: 1},
          },
        },
      ],
    },
    {
      map: '绝情谷（中原）',
      event: [
        {
          list: ['进入绝情谷，触发剧情进入战斗：', '主角 VS 公孙止', '胜后获得[金刀黑剑]，李莫愁入队'],
          reward: {
            itm: {243: 1},
            team: {161: true},
          },
        },
        {
          list: ['进入大厅触发剧情战斗：', 'VS 杨过+小龙女'],
          reward: {mor: -5},
        },
        {
          list: ['剧情后来到右上角调查石碑触发剧情'],
          reward: {},
        },
      ],
    },
    {
      map: '古墓（中原）',
      event: [
        {
          list: ['左下方房间，对话第二个棺材，选择『是』进入密道'],
          reward: {},
        },
        {
          list: ['进入左上石屋触发剧情，获得【金雁功】'],
          reward: {
            itm: {368: 1},
            other: [
              '李莫愁奖励：',
              '第二格武功洗玉女心经1级，第三格武功洗九阴神功1级',
              '天赋内功洗为玉女心经',
            ],
          },
        },
      ],
    },
    {
      map: '江陵（江南）',
      event: [
        {
          list: [
            '进入客栈，触发剧情',
            '剧情后金轮法王出现，带走郭襄',
          ],
          reward: {},
        },
      ],
    },
    {
      map: '万兽山庄（江南）',
      event: [
        {
          list: ['调查后院的宝箱获取天外陨铁，用于修复倚天邪断剑断刀'],
          reward: {
            itm: {263: 2},
          },
        },
      ],
    },
    {
      map: '黑龙潭（江南）',
      event: [
        {
          list: ['进屋与瑛姑对话，答应帮其找周伯通'],
          reward: {},
        },
      ],
    },
    {
      map: '百花谷（中原）',
      event: [
        {
          list: ['与周伯通对话'],
          reward: {mor: 3},
        },
      ],
    },
    {
      map: '黑龙潭（江南）支线',
      event: [
        {
          list: ['对话老顽童，触发剧情'],
          reward: {},
        },
      ],
    },
    {
      map: '百花谷（中原）支线',
      event: [
        {
          list: ['对话周伯通，如之前学有左右互搏则触发概率永久增加20%', '对话瑛姑，主角轻功+20'],
          reward: {
            other: [
              '左右互搏则触发概率永久增加20%',
              '主角轻功+20',
            ],
          },
        },
      ],
    },
    {
      map: '绝情谷（中原）',
      event: [
        {
          list: [
            '李莫愁在队时，右上断崖触发剧情，进入战斗：',
            '主角+李莫愁+金轮法王 VS 周伯通+黄药师+一灯',
            '胜后获得【五轮大转】',
          ],
          reward: {
            itm: {283: 1},
          },
        },
        {
          list: ['进入绝情谷底触发剧情', '剧情后，郭襄进队'],
          reward: {
            itm: {294: 1},
            team: {626: true},
          },
        },
      ],
    },
    {
      map: '襄阳（中原）',
      event: [
        {
          list: [
            '由襄阳进入襄阳城外，触发剧情进入战斗：',
            'VS 蒙哥+四大名捕+一群蒙古兵',
            '胜后获得[飞云骓]《神雕侠侣》【天魔策】',
          ],
          reward: {
            mor: 5,
            itm: {294: 1, 327: 1, 153: 1},
          },
        },
      ],
    },
    {
      map: '峨眉派-峨眉金顶（西部）',
      event: [
        {
          list: ['绝情谷底剧情完结，郭襄在队，可触发郭襄觉醒剧情'],
          reward: {
            other: [
              '郭襄奖励：',
              '攻、防、轻+30，五系兵器值+10，内力变为天罡内力',
            ],
          },
        },
      ],
    },
  ],
  branch: [
    {
      map: '古墓（中原）',
      event: [
        {
          list: ['出生点在古墓'],
          reward: {
            itm: {175: 1},
          },
        },
      ],
    },
    {
      map: '小村（江南）',
      event: [
        {
          list: ['触发剧情后直接获得【铁铲】'],
          reward: {},
        },
      ],
    },
    {
      map: '程英居（江南）',
      event: [
        {
          list: ['进入场景触发战斗：', 'VS 李莫愁', '胜利后程英对话，程英入队，获得【玉箫剑法】'],
          reward: {
            itm: {123: 1},
            team: {63: true},
          },
        },
        {
          list: ['与冯铁匠对话，可收其去小村', '在小村可以向冯铁匠购买一些装备或强化装备'],
          reward: {},
        },
      ],
    },
    {
      map: '绝情谷（中原）射雕桃花岛剧情后开启',
      event: [
        {
          list: [
            '进入大厅触发剧情，剧情后被关起来',
            '调查房间里的兵器架，获得[君子剑][淑女剑]',
            '调查房间大门，触发剧情',
          ],
          itm: {241: 1, 242: 1},
        },
        {
          list: ['剧情后进入大厅，触发战斗：', 'VS公孙止+绝情谷众', '胜后获得【阴阳倒乱刃】'],
          reward: {
            itm: {176: 1},
          },
        },
      ],
    },
    {
      map: '蜘蛛洞（北部）',
      event: [
        {
          list: [
            '打几场蜘蛛，进入最里面触发剧情， 剧情后获得：',
            '【玉女剑法】【玉女心经】【空明拳谱】【左右互搏术】',
            '蜘蛛洞宝箱可用6000两银两打开，可提升主角五系1点和三围1点',
          ],
          reward: {
            mor: 2,
            itm: {119: 1, 280: 1, 98: 1, 235: 1},
          },
        },
      ],
    },
    {
      map: '独孤剑冢（北部）',
      event: [
        {
          list: [
            '进入山洞，触发战斗：',
            'VS 大蛇',
            '对话神雕后神雕加入队伍',
            '拔起神雕旁边的剑获得【玄铁剑】',
            '阅读神雕旁边的墙壁获得【玄铁剑法】，第一格洗玄铁剑法，获得天赋剑魔再临',
          ],
          reward: {
            mor: 2,
            itm: {36: 1, 116: 1},
            team: {628: true},
            other: [
              '杨过奖励：',
              '第一格洗玄铁剑法，获得天赋剑魔再临',
            ],
          },
        },
      ],
    },
    {
      map: '重阳宫（中原）',
      event: [
        {
          list: ['剧情后触发战斗：', 'VS 金轮法王+霍都+达尔巴+西域三魔'],
          reward: {mor: 5},
        },
      ],
    },
    {
      map: '绝情谷（中原）',
      event: [
        {
          list: [
            '程英在队时，进入大厅剧情后触发战斗：',
            '1、VS 裘千尺+绝情谷众',
            '2、VS 公孙止',
            '剧情后小龙女定下十六年之约，杨过离去',
            '*此处小龙女会自动出战',
          ],
          reward: {mor: 5},
        },
      ],
    },
    {
      map: '江陵（江南）',
      event: [
        {
          list: ['进入客栈触发剧情'],
          reward: {},
        },
      ],
    },
    {
      map: '万兽山庄（江南）',
      event: [
        {
          list: ['进入左边房间触发剧情，剧情后郭襄随队行动', '调查后院的宝箱获取天外陨铁，用于修复倚天邪断剑断刀'],
          reward: {
            itm: {263: 2},
          },
        },
      ],
    },
    {
      map: '黑龙潭（江南）',
      event: [
        {
          list: ['进屋与瑛姑对话，答应帮其找周伯通'],
          reward: {},
        },
      ],
    },
    {
      map: '百花谷（中原）',
      event: [
        {
          list: ['与周伯通对话，触发战斗：', '杨过 VS 周伯通', '胜后杨过送【黯然销魂掌】【大伏魔拳】'],
          reward: {
            mor: 3,
            itm: {87: 1, 499: 1},
          },
        },
      ],
    },
    {
      map: '黑龙潭（江南）支线',
      event: [
        {
          list: ['对话周伯通，触发剧情'],
          reward: {},
        },
      ],
    },
    {
      map: '百花谷（中原）支线',
      event: [
        {
          list: ['对话周伯通，如之前学有左右互搏则触发概率永久增加20%', '对话瑛姑，主角轻功+20'],
          reward: {
            other: [
              '左右互搏则触发概率永久增加20%',
              '主角轻功+20',
            ],
          },
        },
      ],
    },
    {
      map: '绝情谷（中原）',
      event: [
        {
          list: ['右上断崖触发剧情，前往绝情谷底'],
          reward: {},
        },
        {
          list: ['来到谷底触发剧情，小龙女入队'],
          reward: {
            itm: {280: 1, 282: 1},
            team: {59: true},
          },
        },
        {
          list: ['从断崖上来，触发剧情'],
          reward: {},
        },
      ],
    },
    {
      map: '襄阳（中原）',
      event: [
        {
          list: [
            '进入襄阳城外，触发剧情进入战斗：',
            '杨过 VS 金轮法王',
            '胜后获得《神雕侠侣》【龙象般若功】【玉女素心剑】 青驴[坐骑]',
          ],
          reward: {
            mor: 5,
            itm: {153: 1, 350: 1, 81: 1, 339: 1},
          },
        },
      ],
    },
  ],
};
