export default {
  normal: [
    {
      map: '凤阳（中原）',
      event: [
        {
          list: ['进入场景，进入场景触发战斗：', '主角+陈家洛 VS 御前侍卫+带刀官兵', '胜后获得【迷踪连环腿】'],
          reward: {
            mor: 2,
            itm: {333: 1},
          },
        },
      ],
    },
    {
      map: '杭州（江南）',
      event: [
        {
          list: ['对话客栈丐帮弟子后，进入六和塔，触发剧情分支'],
          reward: {},
        },
      ],
    },
  ],
  good: [
    {
      map: '杭州-六合塔（江南）',
      event: [
        {
          list: [
            '选择『霍青桐线』，触发战斗：',
            '主角+陈正德+关明梅 VS 常赫志+常伯志',
            '胜后获得【百花错拳】【三分剑术】',
          ],
          reward: {
            itm: {103: 1, 132: 1},
          },
        },
      ],
    },
    {
      map: '回族部落（西部）',
      event: [
        {
          list: ['进入屋子，触发战斗：', 'VS 五毒教徒若干'],
          reward: {},
        },
        {
          list: ['与霍青桐对话，可收其入队，获得【三分剑术】'],
          reward: {
            itm: {132: 1},
            team: {74: true},
          },
        },
        {
          list: ['对话左上角卫兵后，可进入清兵大营'],
          reward: {},
        },
        {
          list: ['从左上角小路进入清兵大营触发战斗：', 'VS 官兵*5'],
          reward: {},
        },
        {
          list: [
            '进入帐篷，霍青桐离队，触发战斗：',
            'VS 张召重+官兵*2',
            '胜后获得【柔云剑谱】【纯阳无极功】',
          ],
          reward: {
            itm: {76: 1, 125: 1},
            team: {74: false},
          },
        },
        {
          list: ['返回回族部落，对话木卓伦'],
          reward: {},
        },
      ],
    },
    {
      map: '沙漠废墟（北部）',
      event: [
        {
          list: ['进入左边房间，触发剧情'],
          reward: {},
        },
        {
          list: ['再次对话霍青桐触发剧情，包里需要有一颗[天王保命丹]'],
          reward: {
            itm: {8: -1},
          },
        },
        {
          list: ['通过密道进入高昌迷宫后，调查右侧石像进入楼兰遗迹'],
          reward: {},
        },
        {
          list: ['调查房间里的尸骨，获得【庖丁解牛刀】【庄子】'],
          reward: {
            itm: {331: 1, 328: 1},
          },
        },
        {
          list: ['原路离开遗迹，对话关东六魔，触发战斗：', '主角+陈家洛+霍青桐 VS 关东六魔'],
          reward: {},
        },
      ],
    },
    {
      map: '回族部落（西部）',
      event: [
        {
          list: ['进入场景，触发战斗：', '主角+李沅芷 VS 精锐骑兵*4'],
          reward: {},
        },
        {
          list: ['与霍青桐对话，可收其入队'],
          reward: {
            team: {74: true},
          },
        },
      ],
    },
    {
      map: '杭州-六合塔（江南）',
      event: [
        {
          list: [
            '左上房间对话文泰来，我方内力全失，触发战斗：（进战内力全失）',
            '主角+霍青桐+文泰来 VS 四大名捕',
            '胜后获得【奔雷手】[凝碧剑]',
            '骆冰、文泰来入队',
          ],
          reward: {
            itm: {329: 1, 41: 1},
            team: {151: true, 154: true},
          },
        },
      ],
    },
    {
      map: '南少林（江南）',
      event: [
        {
          list: [
            '带书剑相关人物进入场景，触发战斗：',
            '1、主角+文泰来 VS 元伤+元悲+元痛',
            '2、VS 南少林众僧',
            '胜后获得【阴阳无极功】',
          ],
          reward: {
            itm: {543: 1},
          },
        },
        {
          list: [
            '调查藏经阁调查藏经阁右边第二排从上数第二格书架',
            '获得《书剑恩仇录》【袈裟伏魔功】【追魂夺命剑】',
            '骆冰、文泰来离队前往小村',
          ],
          reward: {
            itm: {152: 1, 332: 1, 330: 1},
          },
        },
      ],
    },
    {
      map: '回族部落（西部）',
      event: [
        {
          list: ['与陈家洛对话，可收其入队，获得【百花错拳】'],
          reward: {
            itm: {103: 1},
            team: {75: true},
          },
        },
      ],
    },
  ],
  evil: [
    {
      map: '杭州-六合塔（江南）',
      event: [
        {
          list: ['选择『李沅芷线』，触发战斗：', '主角+陈家洛 VS 陈正德', '胜后获得【百花错拳】【三分剑术】'],
          reward: {
            itm: {103: 1, 132: true},
          },
        },
      ],
    },
    {
      map: '龙门客栈（西部）',
      event: [
        {
          list: ['进入客栈左上角房间，战斗：', 'VS 霍青桐'],
          reward: {},
        },
        {
          list: ['客栈门口对话张召重，战斗：', '主角+李沅芷 VS 张召重+官兵若干', '胜后获得【纯阳无极功】'],
          reward: {
            itm: {76: 1},
          },
        },
        {
          list: ['第二天客栈门口与李沅芷对话，可收其入队'],
          reward: {
            team: {569: true},
          },
        },
      ],
    },
    {
      map: '回族部落（西部）',
      event: [
        {
          list: ['左上角小路进入清军大营'],
          reward: {},
        },
        {
          list: ['对话李可秀，触发战斗：', '主角+李沅芷 VS 陈家洛'],
          reward: {},
        },
        {
          list: [
            '左上角帐篷对话李可秀，触发战斗：',
            '主角 VS 张召重',
            '胜后获得【柔云剑谱】',
            '胜后与李沅芷对话，可收其入队',
          ],
          reward: {
            itm: {125: 1},
            team: {569: true},
          },
        },
        {
          list: ['回到回族部落，对话霍青桐，触发剧情：', '主角+李沅芷 VS 精锐骑兵*4'],
          reward: {mor: 2},
        },
      ],
    },
    {
      map: '乌鞘岭（西部）',
      event: [
        {
          list: ['对话陈家洛，触发剧情'],
          reward: {},
        },
      ],
    },
    {
      map: '回族部落（西部）',
      event: [
        {
          list: ['对话霍青桐，触发剧情'],
          reward: {},
        },
        {
          list: ['进入左上角帐篷，触发剧情'],
          reward: {mor: 2},
        },
      ],
    },
    {
      map: '凉州（北部）',
      event: [
        {
          list: ['进入左上角客栈二楼房间，剧情后触发战斗：', '主角 VS 关中三魔'],
          reward: {},
        },
        {
          list: ['右下角房间，与李沅芷对话，可收其入队'],
          reward: {
            team: {569: true},
          },
        },
        {
          list: ['对话城门口阿凡提，触发战斗：', '主角 VS 阿凡提', '胜后获得[毛驴]'],
          reward: {
            itm: {279: 1},
          },
        },
      ],
    },
    {
      map: '沙漠废墟（北部）',
      event: [
        {
          list: ['进入左边房间，对话霍青桐'],
          reward: {},
        },
        {
          list: [
            '出房间，触发战斗：',
            'VS 袁士宵',
            '胜后与霍青桐对话，可收其入队 获得【三分剑术】',
          ],
          reward: {
            itm: {132: 1},
            team: {74: true},
          },
        },
        {
          list: ['通过密道进入高昌迷宫后，调查右侧石像进入楼兰遗迹'],
          reward: {},
        },
        {
          list: ['调查房间里的尸骨，获得【庖丁解牛刀】【庄子】'],
          reward: {
            itm: {331: 1, 328: 1},
          },
        },
      ],
    },
    {
      map: '回族部落（西部）',
      event: [
        {
          list: ['对话木卓伦'],
          reward: {},
        },
      ],
    },
    {
      map: '龙门客栈（西部）',
      event: [
        {
          list: [
            '进客栈，触发战斗：',
            '主角+李沅芷+陆青菲 VS 张召重+关东三魔+四大名捕',
            '胜后获得【无极玄功拳】[青冥剑]',
          ],
          reward: {
            itm: {334: 1, 335: 1},
          },
        },
      ],
    },
    {
      map: '武当山（中原）',
      event: [
        {
          list: ['与张召重对话，可收其入队'],
          reward: {
            itm: {41: 1},
            team: {80: true},
          },
        },
      ],
    },
    {
      map: '南少林（江南）',
      event: [
        {
          list: [
            '带书剑相关人物进入场景，触发战斗：',
            'VS 南少林众僧',
          ],
          reward: {},
        },
        {
          list: [
            '调查藏经阁右边第二排从上数第二格书架',
            '获得《书剑恩仇录》【袈裟伏魔功】【奔雷手】',
            '骆冰、文泰来前往小村',
          ],
          reward: {
            itm: {152: 1, 332: 1, 329: 1},
          },
        },
      ],
    },
  ],
};
