export default {
  normal: [
    {
      map: '龙门客栈（西部）',
      event: [
        {
          list: ['客栈房间与叮当对话'],
          reward: {},
        },
        {
          list: [
            '与最右边房间丁氏门人对话，触发战斗：',
            'VS 丁氏门人*3',
            '胜后，开启宝箱获得[玄冰碧火酒]',
            '将玄冰碧火酒交给叮当',
          ],
          reward: {
            mor: 1,
            itm: {203: 1},
          },
        },
      ],
    },
    {
      map: '长乐帮（江南）',
      event: [
        {
          list: [
            '对着贝海石使用[玄冰碧火酒]，剧情后触发战斗：',
            'VS 吕正平+范一飞+高三娘+风良',
            '胜后获得[千年人参]，剧情后正邪分支',
          ],
          reward: {
            mor: -1,
            itm: {16: 1, 72: 1},
            other: ['石破天内力变为天罡内力'],
          },
        },
      ],
    },
  ],
  good: [
    {
      map: '长乐帮（江南）',
      event: [
        {
          list: ['选择『不去』，开启正线'],
          reward: {mor: 1},
        },
      ],
    },
    {
      map: '紫烟岛（海外）',
      event: [
        {
          list: ['剧情后，触发战斗：', 'VS 丁不三+丁不四'],
          reward: {
            mor: 2,
            team: {582: true},
          },
        },
      ],
    },
    {
      map: '长乐帮（江南）',
      event: [
        {
          list: ['剧情后，与石破天对话'],
          reward: {},
        },
      ],
    },
    {
      map: '凌霄城（西部）',
      event: [
        {
          list: ['VS 看门弟子'],
          reward: {},
        },
        {
          list: ['剧情后触发战斗：', '主角 VS 白万剑', '胜后得[赏善罚恶令]'],
          reward: {
            mor: 1,
            itm: {198: 1, 126: 1},
          },
        },
      ],
    },
    {
      map: '长乐帮（江南）',
      event: [
        {
          list: ['与石破天对话，收石破天入队'],
          reward: {
            mor: 1,
            team: {38: true},
          },
        },
      ],
    },
    {
      map: '侠客岛（江南）',
      event: [
        {
          list: ['对看门的张三使用[赏善罚恶令]', '再进去与龙木岛主对话得[腊八粥]'],
          reward: {},
        },
        {
          list: ['分别与洞内观看壁画的各掌门人对话'],
          reward: {},
        },
        {
          list: [
            '与龙、木岛主对话，剧情后石破天领悟太玄神功，触发战斗：',
            '石破天 VS 龙岛主+木岛主',
            '战斗胜利后获得【太玄经】《侠客行》',
          ],
          reward: {
            itm: {154: 1, 80: 1},
            other: [
              '石破天奖励：',
              '攻击+50，轻功+50，内力上限+3000',
              '第二格武功洗太玄神功一',
              '天赋内功洗为太玄神功',
              '天赋外功洗为太玄神功',
              '阿青奖励：',
              '第二格洗太玄神功',
              '天赋内功洗太玄神功',
            ],
          },
        },
        {
          list: ['再次对话石破天，选择『是』进入战斗：', '主角+石破天 VS 李白'],
          reward: {},
        },
      ],
    },
  ],
  evil: [
    {
      map: '长乐帮（江南）',
      event: [
        {
          list: ['选择『去』接受叮当的要求，开启邪线'],
          reward: {},
        },
      ],
    },
    {
      map: '扬州-天上人间（江南）',
      event: [
        {
          list: ['左上房间，进门触发剧情，触发战斗：', 'VS 张三+李四'],
          reward: {},
        },
      ],
    },
    {
      map: '凌霄城（西部）',
      event: [
        {
          list: ['VS 看门弟子'],
          reward: {},
        },
        {
          list: ['进入场景触发剧情'],
          reward: {
            itm: {126: 1},
          },
        },
      ],
    },
    {
      map: '长乐帮（江南）',
      event: [
        {
          list: ['与贝海石对话，获得[赏善罚恶令]，收贝海石入队'],
          reward: {
            mor: -1,
            itm: {198: 1, 191: 1},
            team: {85: true},
          },
        },
      ],
    },
    {
      map: '侠客岛（江南）',
      event: [
        {
          list: ['进入场景触发剧情：', '主角 VS 谢烟客', '胜后获得《侠客行》【太玄经】【沧溟刀法】'],
          reward: {
            itm: {198: 1, 80: 1, 271: 1},
          },
        },
        {
          list: ['对话石破天，触发战斗：', 'VS 石破天'],
          reward: {
            other: [
              '阿青奖励：',
              '第二格洗太玄神功',
              '天赋内功洗太玄神功',
            ],
          },
        },
      ],
    },
  ],
};
