export default {
  normal: [
    {
      map: '福州（江南））',
      event: [
        {
          list: [
            '进入客栈内，剧情后触发战斗：',
            '主角+令狐冲+岳灵珊+林平之 VS 青城弟子*3',
          ],
          reward: {mor: 1},
        },
        {
          list: ['进入福威镖局，与镖师对话'],
          reward: {},
        },
      ],
    },
    {
      map: '衡阳（江南）',
      event: [
        {
          list: [
            '进入客栈内，剧情后触发战斗：',
            'VS 青城弟子*4',
            '剧情后获得【太岳三青峰】【华山心法】',
          ],
          reward: {
            mor: 1,
            itm: {359: 1, 127: 1},
          },
        },
      ],
    },
    {
      map: '华山下-华山派（中原）',
      event: [
        {
          list: ['与岳灵珊对话'],
          reward: {},
        },
        {
          list: [
            '进入上方的思过崖，剧情后，令狐冲第一格武功洗为独孤九剑八级、攻击+50',
            '与令狐冲对话选『是』与其挑战：',
            '主角 VS 令狐冲（可败）',
            '战斗后会触发成不忧来华山捣乱事件',
            '*此时可选是否体验完整剧情，选『否』则转到第七步：少室山下2',
          ],
          reward: {
            other: [
              '令狐冲奖励：',
              '攻击+50',
              '第一格武功洗为 独孤九剑 八级',
            ],
          },
        },
        {
          list: ['从思过崖回到华山派，触发剧情战斗：', '主角+令狐冲 VS 成不忧'],
          reward: {},
        },
        {
          list: [
            '进入思过崖，剧情后，触发战斗：',
            'VS 桃谷六仙',
            '战斗结束后，与令狐冲对话可收其入队',
          ],
          reward: {
            mor: 1,
            team: {35: true},
            other: [
              '令狐冲：',
              '生命上限-200，内力上限-200，轻功-50',
            ],
          },
        },
        {
          list: ['从思过崖回到华山派，与陆大有对话，获得【紫霞秘籍】'],
          reward: {
            itm: {67: 1},
          },
        },
      ],
    },
    {
      map: '药王庙（中原）',
      event: [
        {
          list: ['进入场景，剧情后触发战斗：', 'VS 封不平+嵩山弟子', '剧情后令狐冲离队'],
          reward: {
            team: {35: false},
          },
        },
      ],
    },
    {
      map: '洛阳城（中原）',
      event: [
        {
          list: ['来到金刀王家，剧情后，与令狐冲对话'],
          reward: {},
        },
        {
          list: ['出洛阳城后，再次进入，与令狐冲对话', '剧情后令狐冲加入，获得【持瑶琴】'],
          reward: {
            itm: {180: 1},
            team: {35: true},
          },
        },
      ],
    },
    {
      map: '五毒教（西部）非必须',
      event: [
        {
          list: ['令狐冲在队与蓝凤凰对话，过剧情', '*畅想任盈盈可再次对话，提前收蓝凤凰入队'],
          reward: {},
        },
      ],
    },
    {
      map: '开封-平一指居（中原）',
      event: [
        {
          list: ['令狐冲在队与平一指对话，之后可去小村收平一指入队'],
          reward: {
            itm: {187: 1},
            team: {28: true},
          },
        },
      ],
    },
    {
      map: '少室山下（中原）',
      event: [
        {
          list: ['令狐冲在队时，进入场景触发剧情，令狐冲离队'],
          reward: {
            team: {35: false},
          },
        },
        {
          list: [
            '出少室山后，再次进入，与令狐冲对话，剧情后触发战斗：',
            'VS 晓风师太+一群喽啰',
            '剧情后与令狐冲对话，收令狐冲入队',
          ],
          reward: {
            team: {35: true},
            other: [
              '道德+1（简易线）',
              '紫霞秘笈[秘籍]+1（简易线）',
              '持瑶琴[秘籍]+1（简易线）',
            ],
          },
        },
      ],
    },
    {
      map: '杭州-梅庄（江南）',
      event: [
        {
          list: [
            '令狐冲在队时，对丹青生使用[溪山旅行图]（天龙剧情推进到大理天龙寺，左上房间宝箱），触发战斗：',
            '主角 VS 丹青生',
          ],
          reward: {
            itm: {22: 1},
          },
        },
        {
          list: [
            '令狐冲在队时，对秃笔翁使用[张旭率意帖]（射雕剧情推进到嘉兴牛家村，右上房间宝箱），触发战斗：',
            '主角 VS秃笔翁',
            '获得【裴将军帖】',
          ],
          reward: {
            itm: {183: 1},
          },
        },
        {
          list: [
            '令狐冲在队时，对黑白子使用[刘仲甫呕血棋谱]（搜刮），触发战斗：',
            '主角 VS 黑白子',
            '获得【玄天指】',
          ],
          reward: {
            itm: {258: 1},
          },
        },
        {
          list: ['令狐冲在队时，对黄钟公使用[广陵散琴曲]（搜刮），触发战斗：', '主角 VS 黄钟公'],
          reward: {},
        },
        {
          list: ['全胜四人之后，离开黄钟公房间', '令狐冲在队时与黑白子对话，剧情后开启梅庄地牢'],
          reward: {},
        },
        {
          list: [
            '进入梅庄地牢，与任我行对话，剧情后触发战斗：',
            '主角 VS 任我行（可败）',
            '获得【吸星大法】',
          ],
          reward: {
            itm: {65: 1},
            other: [
              '主角战胜任我行奖励：',
              '防御+10、轻功+10',
              '令狐冲奖励：',
              '第二格武功洗吸星大法8级',
            ],
          },
        },
        {
          list: ['从地牢出来，剧情后触发战斗：', 'VS 梅庄四友', '战斗后，令狐冲离队'],
          reward: {
            team: {35: false},
          },
        },
      ],
    },
    {
      map: '福州-福威镖局（江南）',
      event: [
        {
          list: ['进入中间房间触发剧情，正邪分支'],
          reward: {},
        },
      ],
    },
  ],
  good: [
    {
      map: '福州-福威镖局（江南）',
      event: [
        {
          list: ['选择『是』相信令狐冲，令狐冲加入'],
          reward: {
            team: {35: true},
            other: [
              '令狐冲[队友]加入',
              '令狐冲奖励：',
              '轻功+40，内力硬上限恢复正常',
            ],
          },
        },
      ],
    },
    {
      map: '华山下-华山派（中原）',
      event: [
        {
          list: ['前往思过崖'],
          reward: {},
        },
        {
          list: ['调查秘洞内墙上文字可提前获得【五岳剑诀】'],
          reward: {
            itm: {299: 1},
          },
        },
      ],
    },
    {
      map: '衡阳（江南）',
      event: [
        {
          list: ['令狐冲在队，进入客栈见莫大触发剧情'],
          reward: {},
        },
      ],
    },
    {
      map: '少室山下-少林寺（中原）',
      event: [
        {
          list: [
            '令狐冲在队，与玄慈对话，触发战斗：',
            'VS 方证+岳不群+左冷禅+慧聪+玄慈+空闻+空性+定闲+天门+莫大+少林弟子',
          ],
          reward: {},
        },
        {
          list: [
            '出少林寺进入少室山下，触发剧情',
            '令狐冲送主角【独孤九剑】，回小村可收令狐冲、任盈盈进队',
          ],
          reward: {
            itm: {114: 1},
            team: {73: true},
          },
        },
      ],
    },
    {
      map: '独孤剑冢（北部）支线',
      event: [
        {
          list: [
            '令狐冲在队，包里有独孤九剑秘籍',
            '阅读神雕旁边的墙壁，触发令狐冲领悟九剑极意剧情，领悟【九剑真传】【无我无剑】天赋',
          ],
          reward: {},
        },
      ],
    },
    {
      map: '五毒教（西部）支线',
      event: [
        {
          list: [
            '获得笑傲天书之前，任盈盈在队时，与蓝凤凰对话，可收蓝凤凰入队',
          ],
          reward: {
            itm: {173: 1},
            team: {25: true},
          },
        },
      ],
    },
    {
      map: '黑木崖（北部）',
      event: [
        {
          list: ['任盈盈在队，与看门的对话，可以进入黑木崖'],
          reward: {},
        },
        {
          list: [
            '进入黑木崖，剧情后触发战斗：',
            'VS 东方不败+梅庄四友+日月神教弟子',
            '胜后获得[绣花针]',
            '包里有太极神功秘籍，开启右边房间宝箱获得[真武剑]',
          ],
          reward: {
            itm: {349: 1},
            other: [
              '真武剑[武器] 拿到太极神功后开启宝箱获得 道德-3',
            ],
          },
        },
        {
          list: [
            '左上房间对话葵花尊者：',
            '主角 VS 葵花尊者',
            '胜后可无视条件修炼葵花宝典',
          ],
          reward: {},
        },
      ],
    },
    {
      map: '华山下-华山派（中原）',
      event: [
        {
          list: ['与岳不群对话'],
          reward: {},
        },
      ],
    },
    {
      map: '嵩山派（中原）',
      event: [
        {
          list: ['进入场景参加五岳剑派并派大会', '*纯对话剧情，可选择直接跳过'],
          reward: {},
        },
      ],
    },
    {
      map: '华山下-华山派（中原）',
      event: [
        {
          list: ['进门触发剧情，前往思过崖'],
          reward: {},
        },
        {
          list: [
            '令狐冲、任盈盈在队，进入华山秘洞，剧情后进入战斗：',
            'VS 左冷禅+林平之+嵩山弟子',
            '随后岳不群出现',
            '主角+令狐冲+任盈盈 VS 岳不群',
            '胜利后得《笑傲江湖》',
            '*如果没提前获取，调查秘洞内墙上文字可获得【五岳剑诀】',
          ],
          reward: {
            itm: {151: 1},
          },
        },
      ],
    },
  ],
  evil: [
    {
      map: '福州-福威镖局（江南）',
      event: [
        {
          list: ['选择『否』进入邪线'],
          reward: {},
        },
      ],
    },
    {
      map: '华山下-华山派（中原）支线',
      event: [
        {
          list: [
            '到思过崖对话林平之',
            '回小村可收林平之、岳灵珊入队，获得【辟邪剑谱】',
          ],
          reward: {
            mor: 4,
            itm: {78: 1},
            team: {36: true, 79: true},
          },
        },
      ],
    },
    {
      map: '青城派（西部）支线',
      event: [
        {
          list: ['林平之在队，与余沧海对话，触发战斗：', 'VS 余沧海+青城弟子*5'],
          reward: {
            other: ['道德-5'],
          },
        },
      ],
    },
    {
      map: '少室山下（中原）',
      event: [
        {
          list: ['进入少室山下，触发剧情'],
          reward: {},
        },
      ],
    },
    {
      map: '黑木崖（北部）',
      event: [
        {
          list: [
            '进入黑木崖，剧情后触发战斗：',
            'VS 东方不败+梅庄四友+日月教徒*10',
            '胜后获得【葵花宝典】[绣花针]',
            '包里有太极神功秘籍，开启右边房间宝箱获得[真武剑]',
          ],
          reward: {
            itm: {349: 1, 93: 1},
            other: [
              '真武剑[武器] 拿到太极神功后开启宝箱获得 道德-3',
            ],
          },
        },
        {
          list: [
            '左上房间对话葵花尊者：',
            '主角 VS 葵花尊者',
            '胜后可无视条件修炼葵花宝典',
          ],
          reward: {},
        },
      ],
    },
    {
      map: '华山下-华山派（中原）',
      event: [
        {
          list: ['与岳不群对话'],
          reward: {mor: -5},
        },
      ],
    },
    {
      map: '嵩山派（中原）',
      event: [
        {
          list: [
            '进入场景参加五岳剑派并派大会：',
            '1、主角 VS 天门',
            '2、主角 VS 定闲',
            '3、主角 VS 莫大',
            '4、主角 VS 左冷禅',
          ],
          reward: {},
        },
      ],
    },
    {
      map: '华山下-华山派（中原）',
      event: [
        {
          list: [
            '与岳不群对话触发战斗：',
            'VS 岳不群+左冷禅+定闲+天门+莫大+五岳派弟子',
            '战斗结束后，获得《笑傲江湖》',
          ],
          reward: {
            itm: {151: 1},
          },
        },
      ],
    },
  ],
  branch: [
    {
      map: '嵩山派、泰山派、衡山派、恒山派',
      event: [
        {
          list: ['五岳剑派并派大会开始前可挑战4派看门弟子跟掌门获取对应门派的秘籍'],
          reward: {
            itm: {128: 1, 129: 1, 130: 1, 131: 1},
          },
        },
      ],
    },
    {
      map: '扬州-天上人间（江南）',
      event: [
        {
          list: ['与田伯光对话，剧情分支'],
          reward: {},
        },
        {
          list: [
            '剧情后选『是』，触发战斗：',
            'VS 余沧海',
            '胜后，田伯光加入，获得【狂风刀法】',
          ],
          reward: {
            mor: -3,
            itm: {161: 1},
            team: {29: true},
          },
        },
        {
          list: [
            '剧情后选『否』，之后再回田伯光居（扬州）',
            '与田伯光对话，若主角道德值≤39，且队伍中有女性，可收田伯光入队，获得【狂风刀法】',
          ],
          reward: {
            other: ['道德-5', '狂风刀法[秘籍]+1', '田伯光加入队伍'],
          },
        },
      ],
    },
  ],
};
