export default {
  normal: [
    {
      map: '玉笔山庄（北部）',
      event: [
        {
          list: [
            '左上山洞进入闯王藏宝洞一路往里走，遇到大雪怪触发战斗：',
            'VS 大雪怪',
            '身上有闯王军刀时，空格点击钥匙孔打开铁门，开启里面四个宝箱可获得：',
            '《雪山飞狐》《飞狐外传》（飞狐外传袁紫衣线可获得）【胡家刀法】【四象步法】【黑风指法】、[鸳刀]、[千年灵芝]、[银两]*2000',
            '* 必须要先完成飞狐外传剧情拿到闯王军刀才能才能打开铁门',
          ],
          reward: {
            itm: {
              145: 1,
              217: 1,
              14: 1,
              266: 1,
              259: 1,
              174: 2000,
            },
            other: [
              '飞狐外传[剧情]+1（飞狐外传袁紫衣线可获得）',
              '萧中慧在队：轻功+50',
              '袁紫衣在队：第三格洗飞天神行，天赋轻功洗飞天神行',
            ],
          },
        },
        {
          list: ['左边大雪怪触发战斗：', 'VS 大雪怪', '开启宝箱获得 [千年人参]'],
          reward: {
            itm: {16: 1},
          },
        },
      ],
    },
  ],
};
