export default {
  normal: [
    {
      map: '朱府（西部）',
      event: [
        {
          list: ['与朱氏父女对话，然后到下方房间窗户处触发剧情，正邪分支'],
          reward: {},
        },
      ],
    },
  ],
  good: [
    {
      map: '朱府（西部）',
      event: [
        {
          list: ['选择『是』，进入正线'],
          reward: {mor: 1},
        },
        {
          list: ['与上面房间张无忌对话，剧情后触发战斗：', 'VS 朱长龄+朱九真'],
          reward: {mor: 1},
        },
      ],
    },
    {
      map: '昆仑派（西部）',
      event: [
        {
          list: ['与守门弟子对话'],
          reward: {},
        },
      ],
    },
    {
      map: '龙门客栈（西部）',
      event: [
        {
          list: [
            '客栈前对话触发剧情：',
            '主角 VS 灭绝 （可败，胜利可获得【峨眉九阳功】，五系兵器值任选其一+10点）',
            '战后殷离入队，得【寒冰绵掌】【千蛛万毒手】',
          ],
          reward: {
            itm: {379: 1, 108: 1, 491: 1},
            team: {646: true},
            other: ['五系兵器值任选其一+10点'],
          },
        },
      ],
    },
    {
      map: '光明顶（西部）',
      event: [
        {
          list: ['剧情后，得【鹰爪功法】', '上房间小昭旁边的蒲团，开启密道'],
          reward: {
            mor: 1,
            itm: {109: 1, 363: 1},
          },
        },
        {
          list: [
            '进入光明顶密道，走到最里面房间，触发战斗：',
            'VS 成昆（坚持到100时序不团灭即可）',
            '100时序战胜成昆奖励 千年灵芝*1',
          ],
          reward: {
            itm: {14: 1},
          },
        },
        {
          list: [
            '调查房间里的尸骨',
            '之后再点击旁边石门离开',
            '*可挑战阳顶天，战胜后获得【乾坤大挪移】【大九天手】，难度较高，可以后期再来挑战',
          ],
          reward: {
            itm: {74: 1, 497: 1},
          },
        },
        {
          list: [
            '再次进入光明顶，剧情后，触发战斗：',
            '1、VS 昆仑派，胜利后得天王保命丹',
            '2、VS 华山派，胜利后得天王保命丹',
            '3、VS 崆峒派，胜利后得天王保命丹',
            '4、主角 VS 空性，胜利后得【龙爪手】 天王保命丹',
            '5、主角 VS 灭绝',
          ],
          reward: {
            mor: 5,
            itm: {8: 4, 92: 1},
          },
        },
      ],
    },
    {
      map: '冰火岛（海外）',
      event: [
        {
          list: ['左下房间调查床上的金毛，获得[一撮金毛]'],
          reward: {
            itm: {211: 1},
          },
        },
      ],
    },
    {
      map: '光明顶（西部）',
      event: [
        {
          list: ['对张无忌使用[一撮金毛]，剧情后张无忌加入', '*昆仑仙境开启'],
          reward: {
            mor: 1,
            team: {9: true},
          },
        },
      ],
    },
    {
      map: '绿柳山庄（西部）',
      event: [
        {
          list: ['对话门口侍女，触发剧情：', '主角 VS 赵敏', '*此战主角内力值为0'],
          reward: {},
        },
      ],
    },
    {
      map: '武当派（中原）',
      event: [
        {
          list: [
            '进入屋子触发剧情：',
            '1、主角 VS 阿三',
            '2、主角 VS 阿二',
            '3、主角 VS 阿大',
            '剧情后，获得【大力金刚指】【倚天屠龙功】【太极拳】【太极剑】【太极神功】',
            '出门得到消息要去万安寺',
          ],
          reward: {
            itm: {
              291: 1,
              169: 1,
              97: 1,
              115: 1,
              295: 1,
            },
            other: [
              '张无忌奖励：',
              '第三格武功洗太极拳1',
              '第四格武功洗太极剑法1',
            ],
          },
        },
      ],
    },
    {
      map: '万安寺（北部）',
      event: [
        {
          list: [
            '剧情后 VS 一堆番僧',
            '解救各派掌门，获得：',
            '【七伤拳谱】【两仪剑谱】【反两仪刀法】【虎爪绝户手】，如有学龙爪手变为必中',
            '最后一个房间开启剧情，然后从铁门处上到万安寺顶',
          ],
          reward: {
            mor: 5,
            itm: {89: 1, 124: 1, 142: 1, 381: 1},
            other: ['龙爪手变为必中'],
          },
        },
        {
          list: [
            '万安寺顶，剧情后进入战斗：',
            'VS 玄冥二老',
            '*左边房间调查左边书架可以获得【玄冥神掌】',
          ],
          reward: {
            itm: {91: 1},
          },
        },
        {
          list: ['从万安寺顶下来，门口对话张无忌'],
          reward: {},
        },
      ],
    },
    {
      map: '龙门客栈（西部）',
      event: [
        {
          list: ['客栈对话赵敏，收赵敏入队，得[倚天剑]'],
          reward: {
            itm: {37: 1},
            team: {609: true},
          },
        },
      ],
    },
    {
      map: '灵蛇岛（海外）',
      event: [
        {
          list: [
            '张无忌在队剧情后触发战斗：',
            'VS 圣火三使',
            '得【阴风刀】【圣火神功】[屠龙刀]，小昭加入',
          ],
          reward: {
            mor: 1,
            itm: {298: 1, 70: 1, 43: 1},
            team: {66: true},
          },
        },
      ],
    },
    {
      map: '光明顶（西部）',
      event: [
        {
          list: ['与谢逊对话，获得【狮吼功法】'],
          reward: {
            itm: {69: 1},
          },
        },
      ],
    },
    {
      map: '成昆居（北部）',
      event: [
        {
          list: ['剧情后，触发战斗：', 'VS 成昆+一群喽啰', '胜后，获得[一颗头颅]'],
          reward: {
            mor: 2,
            itm: {219: 1},
          },
        },
      ],
    },
    {
      map: '光明顶（西部）',
      event: [
        {
          list: ['对着谢逊使用[一颗头颅]，获得《倚天屠龙记》和[九阴真经下卷]'],
          reward: {
            itm: {155: 1, 287: 1},
          },
        },
        {
          list: [
            '再次与谢逊对话，可以选择是否挑战光明之试炼，选『是』：',
            'VS逍遥二仙+四大法王',
            '胜利后主角五系兵器值+10',
          ],
          reward: {
            other: ['主角五系兵器值+10'],
          },
        },
      ],
    },
  ],
  evil: [
    {
      map: '朱府（西部）',
      event: [
        {
          list: ['选择『否』，进入邪线，剧情后朱九真加入'],
          reward: {
            mor: -2,
            team: {81: true},
          },
        },
      ],
    },
    {
      map: '昆仑派（西部）',
      event: [
        {
          list: ['与守门弟子对话'],
          reward: {},
        },
      ],
    },
    {
      map: '光明顶（西部）',
      event: [
        {
          list: ['剧情后，调查左上房间小昭旁边的蒲团，开启密道'],
          reward: {},
        },
        {
          list: ['进入光明顶密道，走到最里面房间，触发战斗：', 'VS 成昆（坚持100时序不团灭即可）'],
          reward: {},
        },
        {
          list: [
            '调查房间里的尸骨',
            '之后再点击旁边石门离开',
            '*可挑战阳顶天，战胜后获得【乾坤大挪移】【大九天手】，难度较高，可以后期再来挑战',
          ],
          reward: {
            itm: {74: 1, 497: 1},
          },
        },
      ],
    },
    {
      map: '成昆居（北部）',
      event: [
        {
          list: ['与成昆对话，得【幻阴指法】'],
          reward: {
            mor: -3,
          },
        },
      ],
    },
    {
      map: '光明顶（西部）',
      event: [
        {
          list: ['与范遥对话'],
          reward: {},
        },
      ],
    },
    {
      map: '灵蛇岛（海外）',
      event: [
        {
          list: ['剧情后触发战斗：', 'VS 圣火三使', '得【阴风刀】【圣火神功】'],
          reward: {
            itm: {298: 1, 70: 1},
          },
        },
      ],
    },
    {
      map: '光明顶（西部）',
      event: [
        {
          list: ['与谢逊或范遥对话'],
          reward: {},
        },
      ],
    },
    {
      map: '昆仑派（西部）',
      event: [
        {
          list: ['剧情后触发战斗：', 'VS 昆仑派', '胜后获得【两仪剑谱】、【七伤拳谱】'],
          reward: {
            mor: -3,
            itm: {89: 1, 124: 1},
          },
        },
      ],
    },
    {
      map: '崆峒派（西部）',
      event: [
        {
          list: [
            'VS 看门弟子',
            '剧情后触发战斗：',
            '1、主角+谢逊+范瑶 VS 崆峒派',
            '2、主角+谢逊+范瑶 VS 崆峒派+华山派，胜后得【反两仪刀法】',
            '3、主角+谢逊+范瑶 VS 崆峒派+华山派+峨眉派，胜后获得[倚天剑]',
            '剧情后谢逊送【狮吼功法】',
            '*昆仑仙境开启',
          ],
          reward: {
            mor: -9,
            itm: {142: 1, 288: 1, 69: 1},
          },
        },
      ],
    },
    {
      map: '峨嵋派（西部）',
      event: [
        {
          list: [
            '进入房间剧情后触发战斗：',
            '主角+周芷若 VS 丁敏君',
            '战后对话周芷若，邀周芷若入队，获得【倚天剑谱】',
          ],
          reward: {
            itm: {120: 1},
            team: {631: true},
          },
        },
      ],
    },
    {
      map: '少室山下-少林寺（中原）',
      event: [
        {
          list: [
            '周芷若在队，进入少林，触发剧情，获得[屠龙刀]',
            '剧情后刀剑互砍，得到[断裂的倚天剑]、[断裂的屠龙刀]',
            '获得[九阴真经下卷]【白蟒鞭法】',
            '周芷若可选是否洗第一格武功为九阴白骨爪或白蟒鞭法',
            '第一格武功洗九阴白骨爪可获得【九阴白骨爪】',
            '*神雕十六年后在万兽山庄获得天外陨铁，可在冯铁匠处使用断刀断剑修复刀剑',
          ],
          reward: {
            itm: {
              287: 1,
              288: 1,
              289: 1,
              290: 1,
              102: 1,
            },
            other: [
              '周芷若奖励：',
              '五系兵器值+10',
              '第一格武功洗九阴白骨爪或白蟒鞭法1，第二格武功洗九阴神功1',
              '天赋外功增加九阴白骨爪，天赋内功洗为九阴神功',
            ],
          },
        },
        {
          list: ['与右上角和尚对话，进入少林后山', '*进去后不打赢出不去'],
          reward: {mor: 1},
        },
        {
          list: [
            '走到里面触发战斗',
            '1.VS 渡劫+渡难+渡厄',
            '选择是否揭发成昆',
            '选择否',
            '获得《倚天屠龙记》【金刚伏魔圈】',
            '选择是',
            '2.VS 成昆+汝阳王府高手',
            '获得《倚天屠龙记》【金刚狮子吼】',
          ],
          reward: {
            mor: 5,
            itm: {171: 1, 155: 1, 385: 1},
          },
        },
      ],
    },
    {
      map: '光明顶（西部）',
      event: [
        {
          list: ['到天书以后，与范遥对话，挑战光明之试炼奖励战', '主角 VS 摩尼'],
          reward: {
            other: ['主角五系兵器值+10'],
          },
        },
      ],
    },
  ],
  branch: [
    {
      map: '凤阳-蝴蝶谷（中原）',
      event: [
        {
          list: [
            '与胡青牛对话，剧情后触发战斗：',
            'VS 金花婆婆',
            '胜后获得【幻尘身法】',
            '对话胡青牛、王难姑后回小村可收胡青牛、王难姑入队',
            '*此剧情在剧情进行到灵蛇岛战圣火三使后便无法进行',
          ],
          reward: {
            mor: 1,
            itm: {541: 1, 189: 1, 192: 1},
            team: {16: true, 17: true},
          },
        },
      ],
    },
    {
      map: '武当派（中原）',
      event: [
        {
          list: [
            '与张三丰对话，再次与其对话：',
            '获得【绕指柔剑】',
            '主角道德≥65时，获得【无极玄功拳】',
            '主角道德≥75时，获得【龟息功】',
            '主角道德≥85时，获得【神门剑谱】',
          ],
          reward: {
            itm: {402: 1, 334: 1, 371: 1, 375: 1},
          },
        },
        {
          list: [
            '再次对话张三丰，可以选择挑战',
            '战胜张三丰（张三丰血量降低50%或坚持200时序后）后可激活太极神功特效【太衍噬法】',
            '倚天正带张无忌再次对话张三丰，可获的【太极拳】【太极剑法】',
          ],
          reward: {
            other: [
              '太极拳[秘籍]+1',
              '太极剑法[秘籍]+1',
            ],
          },
        },
      ],
    },
    {
      map: '武当派（中原）',
      event: [
        {
          list: [
            '与宋远桥对话接受龙门镖局任务（有武当派的在队需取消学武功的人物选择来触发对话），前往杭州龙门镖局，对尸体空格，触发剧情：',
            'VS少林铜人×3+空性',
            '胜利后返回武当对话宋远桥，获得【武当九阳功】',
          ],
          reward: {
            itm: {378: 1},
          },
        },
      ],
    },
    {
      map: '冰火岛（海外）',
      event: [
        {
          list: ['正线开启冰火岛，进入最里面，遇见火蟾，触发战斗：', 'VS 火蟾', '胜后获得[火蟾]'],
          reward: {
            itm: {231: 1},
          },
        },
        {
          list: ['光明顶，对蝠王使用[火蟾]（如有拿神木王鼎，建议用来炼地灵丹）'],
          reward: {
            other: ['道德+1'],
          },
        },
      ],
    },
    {
      map: '峨眉派（西部）',
      event: [
        {
          list: ['正邪分支后，左侧小路触发剧情，剧情分支'],
          reward: {},
        },
        {
          list: ['选择『是』，触发战斗：', 'VS 莫声谷', '胜后，宋青书加入，获得【绵掌掌谱】'],
          reward: {
            branch: {id: 1, name: '帮宋青书'},
            mor: -8,
            itm: {106: 1},
            team: {82: true},
          },
        },
        {
          list: ['选择『否』，触发战斗：', '莫声谷 VS 宋青书', '胜后获得【神门剑谱】'],
          reward: {
            branch: {id: 1, name: '帮莫声谷'},
            mor: 1,
            itm: {375: 1},
          },
        },
      ],
    },
    {
      map: '昆仑仙境（西部）',
      event: [
        {
          list: [
            '正线张无忌入队后开启',
            '1. 进入触发剧情：',
            '主角+白猿 VS 金轮众人',
            '胜后，获得【猿公剑法】【楞伽经】',
            '*少林寺达摩堂佛像前使用楞伽经可选择研读[楞伽经]，选『是』则：VS斗酒僧，胜利后获得【九阳真经】',
            '2. 与屋子里的阿青对话，触发战斗：',
            'VS 阿青',
            '胜后，道德>100，阿青加入，获得【越女剑法】【白猿】',
          ],
          reward: {
            itm: {325: 1, 278: 1, 326: 1, 293: 1},
            team: {604: true},
          },
        },
        {
          list: [
            '邪线崆峒三连战后开启',
            '1. 右上角落石碑处使用[铁铲]',
            '主角 VS 阿青+白猿',
            '胜利后获得【楞伽经】【猿公剑谱】',
            '*少林寺达摩堂佛像前使用楞伽经可选择研读[楞伽经]，选『是』则：VS斗酒僧，胜利后获得【九阳真经】',
            '2. 与屋子里的阿青对话，触发战斗：',
            'VS 阿青',
            '胜后，道德>100，阿青加入，获得【越女剑法】【白猿】',
          ],
          reward: {
            other: [
              '越女剑法[秘籍]+1',
              '楞伽经[剧情]+1',
              '猿公剑法[秘籍]+1',
              '白猿[坐骑]+1',
              '阿青加入队伍',
            ],
          },
        },
      ],
    },
  ],
};
