export default {
  normal: [
    {
      map: '乌鞘岭（西部）',
      event: [
        {
          list: ['与剧情人物对话，触发战斗：', 'VS 周威信', '胜后获得【呼延鞭法】'],
          reward: {
            itm: {352: 1},
          },
        },
      ],
    },
    {
      map: '凉州（北部）',
      event: [
        {
          list: ['进入客栈二楼触发剧情'],
          reward: {},
        },
        {
          list: ['出客栈后，与萧中慧对话，触发战斗：', '主角+萧中慧 VS 林玉龙+任飞燕', '胜后获得【鸳鸯刀法】'],
          reward: {
            itm: {162: 1},
          },
        },
        {
          list: ['凉州左上出口进入小树林，触发战斗：', '主角+袁冠南 VS 卓天雄', '胜后，袁冠南加入，获得[鸯刀]'],
          reward: {
            itm: {218: 1},
            team: {566: true},
          },
        },
        {
          list: ['小树林左上出口进入紫竹庵，对话尼姑触发剧情', '萧中慧加入，获得[鸳刀]【夫妻刀法】'],
          reward: {
            itm: {217: 1, 140: 1},
            team: {77: true},
          },
        },
        {
          list: [
            '出紫竹庵大门，触发战斗：',
            '主角+萧中慧+袁冠南 VS 卓天雄+周威信+大内高手*4',
            '胜后，获得[天王保命丹]*2',
          ],
          reward: {
            itm: {8: 2},
          },
        },
      ],
    },
    {
      map: '晋阳 （北部）',
      event: [
        {
          list: [
            '进入萧半和家，剧情后触发战斗：',
            '主角+萧中慧+袁冠南 VS 卓天雄+周威信+大内高手*4+精锐骑兵*4',
            '萧中慧、袁冠南离队',
          ],
          reward: {
            team: {77: false, 566: false},
          },
        },
        {
          list: ['晋阳左上角出口进入中条山，与袁冠南、萧中慧对话可收2人入队'],
          reward: {
            team: {77: true, 566: true},
          },
        },
      ],
    },
    {
      map: '鸳鸯岛（海外）',
      event: [
        {
          list: [
            '对话萧半和，触发战斗：',
            'VS 萧半和',
            '胜利后获得《鸳鸯刀》【葵花点穴手】【中庸之道】',
            '开启宝箱获得[银两]*2000、[千年灵芝]*1',
          ],
          reward: {
            mor: 1,
            itm: {
              14: 1,
              372: 1,
              370: 1,
              157: 1,
              174: 2000,
            },
            other: [
              '萧中慧：',
              '第一格武功洗夫妻刀法1级',
            ],
          },
        },
      ],
    },
  ],
};
